package com.fantingame.pay.utils.bill99;

import java.util.HashMap;


public class Bill99Code {
	
	private static HashMap<String, String> map = new HashMap<String, String>();
	
	static{
		map.put("00000","未知错误");
		map.put("10001","不支持的字符编码格式,系统支持的字符编码格式为1.GBK,2.UTF-8,3.GB2312");
		map.put("10002","不支持的返回类型,系统支持的返回类型为1.页面返回,2.后台返回,3.同时支持页面和后台返回");
		map.put("10003","页面返回地址为空或不合法,请使用一个未带参数的http或者https的合法URL地址");
		map.put("10004","后台返回地址为空或不合法,请使用一个未带参数的http或者https的合法URL地址");
		map.put("10005","不支持的网关接口版本号,目前系统支持的版本号为V2.0");
		map.put("10006","商户快钱用户名不存在");
		map.put("10007","页面返回地址和后台返回地址不能都为空,请使用一个未带参数的http或者https的合法URL地址");
		map.put("10010","订单号不正确,系统只支持以字母,数字组合的订单号");
		map.put("10011","订单金额不正确,请输入以分为单位的金额");
		map.put("10012","订单提交时间不正确,请输入以yyyyMMddhhmmss格式的时间字符串");
		map.put("10013","商品名称不正确");
		map.put("10014","商品数量不正确");
		map.put("10015","商品ID不正确");
		map.put("10016","商品的描述不正确");
		map.put("10017","扩展参数一不正确");
		map.put("10018","扩展参数二不正确");
		map.put("10019","指定的支付方式不正确");
		map.put("10020","指定的支付服务代码不正确");
		map.put("10021","指定的银行ID不正确");
		map.put("10022","不支持的语言类型,系统支持的语言为1.中文,2.英文");
		map.put("10023","不支持的签名类型,系统支持的签名类型为1.MD5");
		map.put("10024","商户未开通快钱充值卡网关");
		map.put("10025","支付人联系方式仅允许Email");
		map.put("10026","支付人联系方式仅允许电话或手机");
		map.put("10027","订单金额不正确,请输入大于1或小于500的以元为单位的金额");
		map.put("20001","订单信息的签名内容不正确");
		map.put("30001","签名类型为空或不正确(签名类型为1)");
		map.put("30002","安全校验域不正确");
		map.put("30003","商户的充值卡收款账户为空或不正确");
		map.put("30004","订单号不正确");
		map.put("30005","订单金额为空或不正确");
		map.put("30006","mac不正确");
		map.put("30007","商户收款账户被冻结");
		map.put("30008","收款账户类型不存在");
		map.put("30009","商户没有开通快钱充值卡支付网关");
		map.put("30010","商户账户状态异常");
		map.put("30011","支付方式状态异常");
		map.put("30012","卡密直连参数错误");
		map.put("30013","订单金额不是整数,不是标准的充值卡面额,无法支付");
		map.put("30014","参数类型不正确");
		map.put("30015","支付密码不正确");
		map.put("30016","余额不足");
		map.put("30017","bgUrl和pageUrl不正确");
		map.put("30018","商户账户不存在");
		map.put("30019","卡密已失效");
		map.put("30020","订单已存在不能重复提交");
		map.put("30021","卡密不正确,请重新确认再输入");
		map.put("30022","商户账户状态被止入");
		map.put("30023","全额支付标志为空");
		map.put("30024","全额支付标志只能为0(不支持全额支付)或1(支持全额支付)");
		map.put("30025:订单提交时间为空或格式不正确(正确格式为:yyyymmddHIMMSS.例如","20080913090103)");
		map.put("30026","订单批次号不能为空");
		map.put("30027","订单批次号或订单已经存在不能重复提交");
		map.put("30028","商品数量为0～999之间");
		map.put("30029","对不起,由于您在支付页面上停留的时间过长,此次支付会话已失效.请重新从商户网站提交订单并支付");
		map.put("30030","参数值不能包含，‘’，“”＆＜＞（）＃＄？＊等特殊符号,否则将会导致校验失败.");
		map.put("30031","帐户余额不足,请选择卡密支付");
		map.put("0","充值失败");
		map.put("1","订单金额不能小于1元");
		map.put("2","系统正在维护当中,请稍后再试");
		map.put("3","卡密销卡失败");
		map.put("4","亲爱的用户,对不起!因为运营商流量的限制，目前暂时无法处理您的请求，请您稍后在重新提交。对于给您带来的不便，我们深感抱歉!谢谢您的配合!");
		map.put("5","系统正在维护当中,暂时无法进行充值,请稍后再试");
		map.put("120","您的订单已受理，快钱处理完成后会将处理结果发送到您的邮箱，并且直接通知商户。请耐心等待，谢谢！");
		map.put("121","系统正在维护中,暂时无法进行支付");
		map.put("122","参数不符合接口规范,无法进行交易");
		map.put("123","系统正在维护当中,暂时无法进行支付,请稍后再试");
		map.put("126","您的订单已经处理,因为网络问题暂时无法与商户进行通讯,请来电快钱查询订单的处理情况,谢谢!");
		map.put("500","订单金额不能大于500元");
		map.put("101","您输入的卡号错误");
		map.put("102","您输入的密码错误");
		map.put("103","您提交的卡号或密码重试次数过多");
		map.put("104","您提交的卡密已被使用过");
		map.put("105","暂不支持该充值卡的支付");
		map.put("106","您选择的卡面额不正确");
		map.put("107","运营商支付系统维护");
		map.put("108","充值卡密码已失效，或已过有效期");
		map.put("110","卡号和密码不是来源于同一张充值卡");
		map.put("111","其它错误");
	}
	
	public static String getMsg(String code){
		return map.get(code);
	}

}
